app/views/comments/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<div class="content"><%= comment.content %></div>
	<% u = User.find(comment.user_material.user_id) %>