app/controllers/materials_controller.rb

SELECT "levels".* FROM "levels" WHERE "levels"."id" IN (13, 4, 14, 3, 7, 9, 5, 11, 6, 1)
SELECT "materials".* FROM "materials" WHERE (lower(title) like '%a%' OR lower(description) like '%a%' AND public_level = 1)
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" IN (3, 10, 4, 9, 7, 5, 1)
---
  def all
    if params[:find].present?
      @materials = Material.includes(:subject, :level).where("lower(title) like ? OR lower(description) like ? AND public_level = 1", "%#{params[:find].downcase}%", "%#{params[:find].downcase}%")

SELECT  1 AS one FROM "questions" WHERE "questions"."material_id" = $1 LIMIT $2  [["material_id", 28], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."material_id" = $1  [["material_id", 28]]
SELECT  "user_materials".* FROM "user_materials" WHERE "user_materials"."material_id" = $1 AND "user_materials"."user_id" = $2 LIMIT $3  [["material_id", 28], ["user_id", 1], ["LIMIT", 1]]
---
  def edit
    unless @material.questions.any?
     @question = @material.questions.build()
     @question.alternatives.build
    end
    @comments = Comment.includes(:user_material).reverse

SELECT  "user_materials".* FROM "user_materials" WHERE "user_materials"."material_id" = $1 AND "user_materials"."user_id" = $2 LIMIT $3  [["material_id", 28], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_material_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "adla;dka;dkad"], ["user_material_id", 322], ["created_at", 2017-03-27 19:08:44 UTC], ["updated_at", 2017-03-27 19:08:44 UTC]]
---
  def add_comment
    @user_material = UserMaterial.find_by(material_id: params[:material_id], user_id: current_user.id)
    Comment.create(content: params[:comment], user_material_id: @user_material.id)

SELECT  "materials".* FROM "materials" WHERE "materials"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    def set_material
      @material = Material.find(params[:id])