app/views/materials/_pre_form.html.erb

SELECT "subjects".* FROM "subjects"
SELECT "levels".* FROM "levels"
---

  <li><h5>Asignatura</h5> <%= f.collection_select :subject_id, Subject.all, :id, :name %></li>
  <li><h5>Nivel</h5> <%= f.collection_select :level_id, Level.all, :id, :name %> </li>